// gameData.js
export const GROUP_TITLES = [
  "Μονάδες εισόδου", "Μονάδες εξόδου", "Λογισμικό Συστήματος", "Εφαρμογές",
  "Λειτουργικά Συστήματα", "Λογισμικό Εφαρμογών", "Διαχείριση αρχείων", "GUI",
  "Εσωτερικά εξαρτήματα", "Αποθηκευτικά μέσα",
];


export const SOLUTIONS = [
  ["Βιντεοκάμερα", "Πληκτρολόγιο", "Ποντίκι", "Σαρωτής"],
  ["Εκτυπωτής", "Ηχεία", "Ακουστικά", "Βιντεοπροβολέας"],
  ["BIOS", "Διεπαφή", "Λειτουργικό Σύστημα", "Drivers"],
  ["Κειμενογράφος", "Παιχνίδια", "Φυλλομετρητής", "Υπολογιστικό φύλλο"],
  ["Windows", "MacOS", "Android", "Linux"],
  ["Επικοινωνία", "Ανάγκες", "Εργασίες", "Διασκέδαση"],
  ["Δέντρο καταλόγων", "Root", "Φάκελος", "Αρχείο"],
  ["Κουμπιά", "Κλικ", "Εικονίδια", "Παράθυρο"],
  ["CPU", "RAM", "Μητρική πλακέτα", "Κάρτα γραφικών"],
  ["SSD", "HDD", "USB stick", "Cloud"],
];