// gameData.jsx
export const LEVELS = [
  {
    id: 1,
    // Provide a large pool of groups here
    groups: [
      { title: "Μονάδες εισόδου", solution: ["Web κάμερα", "Πληκτρολόγιο", "Ποντίκι", "Σαρωτής"] },
      { title: "Μονάδες εξόδου", solution: ["Εκτυπωτής", "Ηχεία", "Ακουστικά", "Βιντεοπροβολέας"] },
      { title: "Λογισμικό Συστήματος", solution: ["BIOS", "Διεπαφή", "Λειτουργικό Σύστημα", "Drivers"] },
      { title: "Εφαρμογές", solution: ["Κειμενογράφος", "Παιχνίδια", "Ζωγραφική", "Υπολογιστικά φύλλα"] },
      { title: "Λειτουργικά Συστήματα", solution: ["Windows", "MacOS", "Android", "Linux"] },
      { title: "Λογισμικό Εφαρμογών", solution: ["Επικοινωνία", "Ανάγκες", "Εργασίες", "Διασκέδαση"] },
      { title: "Διαχείριση αρχείων", solution: ["Δέντρο καταλόγων", "Root", "Φάκελοι", "Αρχεία"] },
      { title: "GUI", solution: ["Κουμπιά", "Κλικ", "Εικονίδια", "Παράθυρο"] },
      { title: "Εσωτερικά εξαρτήματα", solution: ["CPU", "RAM", "Μητρική πλακέτα", "Κάρτα γραφικών"] },
      { title: "Αποθηκευτικά μέσα", solution: ["SSD", "HDD", "Μνήμη USB", "Cloud"] },
      { title: "Θύρες", solution: ["HDMI", "USB", "Ethernet", "VGA"] }
    ]
  },
  {
    id: 2,
    groups: [
      { title: "Δικτυακές συσκευές", solution: ["Η/Υ", "Έξυπνες συσκευές", "Εκτυπωτές", "Tablet"] },
      { title: "Δίκτυο Κινητής Τηλεφωνίας", solution: ["Κυψελωτό", "Σταθμός βάσης", "Ραδιοκύματα", "Κινητό"] },
      { title: "Δημόσιο Τηλεφωνικό Δίκτυο", solution: ["Τηλέφωνο", "VoIP", "Φωνή", "PSTN"] },
      { title: "Διαδίκτυο", solution: ["Client-Server", "TCP/IP", "Παγκόσμιο", "ISP"] },
      { title: "Είδη Δικτύων Υπολογιστών", solution: ["Ασύρματο", "Τοπικό", "Ευρείας Περιοχής", "Σώματος"] },
      { title: "Ενεργός εξοπλισμός δικτύου", solution: ["Router", "Switch", "Access Point", "MODEM"] },
      { title: "Υπηρεσίες Διαδικτύου", solution: ["Παγκόσμιος Ιστός", "email", "FTP", "Chat & Messaging"] },
      { title: "Φυλλομετρητής", solution: ["https://", "Ιστοσελίδα", "Μηχανή Αναζήτησης", "Διεύθυνση URL"] },
      { title: "Ασύρματη σύνδεση", solution: ["WiFi", "Bluetooth", "Δορυφορική", "NFC"] },
      { title: "Ενσύρματη σύνδεση", solution: ["USB", "UTP", "Firewire", "Οπτική ίνα"] },
      { title: "Δίκτυο Υπολογιστών", solution: ["Σύνδεση", "Συσκευές", "Σταθμός", "Κόμβος"] }
    ]
  }
];